[Killed] BlockStatement
src/lib/api-utils.js:6:43
  * @param {string} text - Raw response from Gemini
  * @returns {string} - Cleaned JSON string
  */
-export function cleanGeminiResponse(text) {
-  if (!text) return ''
-  return text.replace(/```json\n?|\n?```/g, '').trim()
-}
+export function cleanGeminiResponse(text) {}
 
 /**
killedBy: api-utils cleanGeminiResponse should remove markdown json blocks
statusReason: expected undefined to be '{"title": "Test"}' // Object.is equality

[Killed] ConditionalExpression
src/lib/api-utils.js:7:7
  * @returns {string} - Cleaned JSON string
  */
 export function cleanGeminiResponse(text) {
-  if (!text) return ''
+  if (true) return ''
   return text.replace(/```json\n?|\n?```/g, '').trim()
 }
killedBy: api-utils cleanGeminiResponse should remove markdown json blocks
statusReason: expected '' to be '{"title": "Test"}' // Object.is equality

[Killed] ConditionalExpression
src/lib/api-utils.js:7:7
  * @returns {string} - Cleaned JSON string
  */
 export function cleanGeminiResponse(text) {
-  if (!text) return ''
+  if (false) return ''
   return text.replace(/```json\n?|\n?```/g, '').trim()
 }
killedBy: api-utils cleanGeminiResponse should handle empty input
statusReason: Cannot read properties of null (reading 'replace')

[Killed] MethodExpression
src/lib/api-utils.js:8:10
  */
 export function cleanGeminiResponse(text) {
   if (!text) return ''
-  return text.replace(/```json\n?|\n?```/g, '').trim()
+  return text.replace(/```json\n?|\n?```/g, '')
 }
 
killedBy: api-utils cleanGeminiResponse should remove markdown blocks without json tag
statusReason: expected '\n{"title": "Test"}' to be '{"title": "Test"}' // Object.is equality

[Killed] Regex
src/lib/api-utils.js:8:23
  */
 export function cleanGeminiResponse(text) {
   if (!text) return ''
-  return text.replace(/```json\n?|\n?```/g, '').trim()
+  return text.replace(/```json\n?|\n```/g, '').trim()
 }
 
killedBy: api-utils cleanGeminiResponse should remove markdown blocks without json tag
statusReason: expected '```\n{"title": "Test"}' to be '{"title": "Test"}' // Object.is equality

[Killed] BlockStatement
src/lib/api-utils.js:16:49
  * @param {Array} recipes - List of recipe objects
  * @returns {string} - Formatted prompt string
  */
-export function formatRecipesForPrompt(recipes) {
-  if (!recipes || !Array.isArray(recipes)) return ''
-  return recipes
-    .map((r) => {
-      const ingredientsList = (r.ingredients || []).map((i) => `• ${i.amount} ${i.name}`).join('\n')
-      return `${r.title}\nIngredients:\n${ingredientsList}`
-    })
-    .join('\n\n')
-}
+export function formatRecipesForPrompt(recipes) {}
 
killedBy: api-utils formatRecipesForPrompt (Property-Based Testing) should always include the recipe title and every ingredient name in the output
statusReason: Property failed after 1 tests
{ seed: -2074614093, path: "0:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: [[{"title":" ","ingredients":[{"name":" ","amount":""}]}]]
Shrunk 8 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BooleanLiteral
src/lib/api-utils.js:17:19
  * @returns {string} - Formatted prompt string
  */
 export function formatRecipesForPrompt(recipes) {
-  if (!recipes || !Array.isArray(recipes)) return ''
+  if (!recipes || Array.isArray(recipes)) return ''
   return recipes
     .map((r) => {
killedBy: api-utils formatRecipesForPrompt (Property-Based Testing) should always include the recipe title and every ingredient name in the output
statusReason: Property failed after 1 tests
{ seed: 113022448, path: "0:0:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: [[{"title":" ","ingredients":[{"name":" ","amount":""}]}]]
Shrunk 9 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/lib/api-utils.js:17:7
  * @returns {string} - Formatted prompt string
  */
 export function formatRecipesForPrompt(recipes) {
-  if (!recipes || !Array.isArray(recipes)) return ''
+  if (false) return ''
   return recipes
     .map((r) => {
killedBy: api-utils formatRecipesForPrompt (Property-Based Testing) should return empty string for invalid inputs
statusReason: Cannot read properties of null (reading 'map')

[Killed] BlockStatement
src/lib/api-utils.js:19:17
 export function formatRecipesForPrompt(recipes) {
   if (!recipes || !Array.isArray(recipes)) return ''
   return recipes
-    .map((r) => {
-      const ingredientsList = (r.ingredients || []).map((i) => `• ${i.amount} ${i.name}`).join('\n')
-      return `${r.title}\nIngredients:\n${ingredientsList}`
-    })
+    .map((r) => {})
     .join('\n\n')
 }
killedBy: api-utils formatRecipesForPrompt (Property-Based Testing) should always include the recipe title and every ingredient name in the output
statusReason: Property failed after 1 tests
{ seed: 1968527144, path: "0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: [[{"title":" ","ingredients":[{"name":" ","amount":""}]}]]
Shrunk 6 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArrowFunction
src/lib/api-utils.js:20:57
   if (!recipes || !Array.isArray(recipes)) return ''
   return recipes
     .map((r) => {
-      const ingredientsList = (r.ingredients || []).map((i) => `• ${i.amount} ${i.name}`).join('\n')
+      const ingredientsList = (r.ingredients || []).map(() => undefined).join('\n')
       return `${r.title}\nIngredients:\n${ingredientsList}`
     })
killedBy: api-utils formatRecipesForPrompt (Property-Based Testing) should always include the recipe title and every ingredient name in the output
statusReason: Property failed after 1 tests
{ seed: 987883984, path: "0:0:0:0:0:1:0:0:0:1:1", endOnFailure: true }
Counterexample: [[{"title":" ","ingredients":[{"name":"!","amount":""}]}]]
Shrunk 10 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] LogicalOperator
src/lib/api-utils.js:20:32
   if (!recipes || !Array.isArray(recipes)) return ''
   return recipes
     .map((r) => {
-      const ingredientsList = (r.ingredients || []).map((i) => `• ${i.amount} ${i.name}`).join('\n')
+      const ingredientsList = (r.ingredients && []).map((i) => `• ${i.amount} ${i.name}`).join('\n')
       return `${r.title}\nIngredients:\n${ingredientsList}`
     })
killedBy: api-utils formatRecipesForPrompt (Property-Based Testing) should always include the recipe title and every ingredient name in the output
statusReason: Property failed after 1 tests
{ seed: 225706824, path: "0:0:0:0:2:0:0:0:0:0:1:1", endOnFailure: true }
Counterexample: [[{"title":" ","ingredients":[{"name":"J","amount":""}]}]]
Shrunk 11 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
