[Killed] EqualityOperator
src/components/recipe-manager/grocery-utils.js:2:19
 export const generateGroceryList = async (recipes) => {
-  if (!recipes || recipes.length === 0) return '# Grocery List\n\nNo recipes selected.'
+  if (!recipes || recipes.length !== 0) return '# Grocery List\n\nNo recipes selected.'
 
   try {
killedBy: grocery-utils should return empty message when no recipes
statusReason: expected '# Offline Mode\n\nUnable to connect t…' to contain 'No recipes selected'

[Killed] LogicalOperator
src/components/recipe-manager/grocery-utils.js:2:7
 export const generateGroceryList = async (recipes) => {
-  if (!recipes || recipes.length === 0) return '# Grocery List\n\nNo recipes selected.'
+  if (!recipes && recipes.length === 0) return '# Grocery List\n\nNo recipes selected.'
 
   try {
killedBy: grocery-utils should return empty message when no recipes
statusReason: expected '# Offline Mode\n\nUnable to connect t…' to contain 'No recipes selected'

[Killed] BlockStatement
src/components/recipe-manager/grocery-utils.js:4:7
 export const generateGroceryList = async (recipes) => {
   if (!recipes || recipes.length === 0) return '# Grocery List\n\nNo recipes selected.'
 
-  try {
-    const response = await fetch('/api/generate-grocery-list', {
-      method: 'POST',
-      headers: {
-        'Content-Type': 'application/json',
-      },
-      body: JSON.stringify({ recipes }),
-    })
-
-    if (!response.ok) {
-      throw new Error('API request failed')
-    }
-
-    const data = await response.json()
-    return data.text
-  } catch (error) {
+  try {} catch (error) {
     console.error('Gemini API Error:', error)
     return (
killedBy: grocery-utils Offline Mode / Fallback logic should generate a manual list if the API fetch fails
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Survived] StringLiteral
src/components/recipe-manager/grocery-utils.js:14:23
     })
 
     if (!response.ok) {
-      throw new Error('API request failed')
+      throw new Error("")
     }
 

[Killed] BlockStatement
src/components/recipe-manager/grocery-utils.js:19:19
 
     const data = await response.json()
     return data.text
-  } catch (error) {
-    console.error('Gemini API Error:', error)
-    return (
-      '# Offline Mode\n\nUnable to connect to AI service. Please try again later.\n\n' +
-      recipes
-        .map((r) => {
-          const checkedList = r.ingredients.map((i) => `- [ ] ${i.amount} ${i.name}`).join('\n')
-          return `## ${r.title}\n${checkedList}`
-        })
-        .join('\n\n')
-    )
-  }
+  } catch (error) {}
 }
 
killedBy: grocery-utils Offline Mode / Fallback logic should generate a manual list if the API fetch fails
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Survived] StringLiteral
src/components/recipe-manager/grocery-utils.js:20:19
     const data = await response.json()
     return data.text
   } catch (error) {
-    console.error('Gemini API Error:', error)
+    console.error("", error)
     return (
       '# Offline Mode\n\nUnable to connect to AI service. Please try again later.\n\n' +

[Killed] BlockStatement
src/components/recipe-manager/grocery-utils.js:24:21
     return (
       '# Offline Mode\n\nUnable to connect to AI service. Please try again later.\n\n' +
       recipes
-        .map((r) => {
-          const checkedList = r.ingredients.map((i) => `- [ ] ${i.amount} ${i.name}`).join('\n')
-          return `## ${r.title}\n${checkedList}`
-        })
+        .map((r) => {})
         .join('\n\n')
     )
killedBy: grocery-utils Offline Mode / Fallback logic should generate a manual list if the API fetch fails
statusReason: expected '# Offline Mode\n\nUnable to connect t…' to contain 'Pasta'

[Killed] ArrowFunction
src/components/recipe-manager/grocery-utils.js:25:49
       '# Offline Mode\n\nUnable to connect to AI service. Please try again later.\n\n' +
       recipes
         .map((r) => {
-          const checkedList = r.ingredients.map((i) => `- [ ] ${i.amount} ${i.name}`).join('\n')
+          const checkedList = r.ingredients.map(() => undefined).join('\n')
           return `## ${r.title}\n${checkedList}`
         })
killedBy: grocery-utils Offline Mode / Fallback logic should generate a manual list if the API fetch fails
statusReason: expected '# Offline Mode\n\nUnable to connect t…' to contain '- [ ] 1 box Noodles'

[Survived] StringLiteral
src/components/recipe-manager/grocery-utils.js:25:92
       '# Offline Mode\n\nUnable to connect to AI service. Please try again later.\n\n' +
       recipes
         .map((r) => {
-          const checkedList = r.ingredients.map((i) => `- [ ] ${i.amount} ${i.name}`).join('\n')
+          const checkedList = r.ingredients.map((i) => `- [ ] ${i.amount} ${i.name}`).join("")
           return `## ${r.title}\n${checkedList}`
         })

[Survived] StringLiteral
src/components/recipe-manager/grocery-utils.js:28:15
           const checkedList = r.ingredients.map((i) => `- [ ] ${i.amount} ${i.name}`).join('\n')
           return `## ${r.title}\n${checkedList}`
         })
-        .join('\n\n')
+        .join("")
     )
   }
